#5 користувач вводить 2 букви. визначити на яких місцях алфафіту вони стоять, і скільки мідж ними знаходиться букв.
let1 = input('введіть будь-яку прописну літеру англійського алфавіту >>> ')
let2 = input('введіть будь-яку прописну літеру англійського алфавіту >>> ')

if ord(let1) and ord(let2) in range(97, 123):
    print('літера', let1, 'має номер в ASCI коді ', ord(let1))
    print('літера', let2, 'має номер в ASCI коді ', ord(let2))
    print('літера', let1, 'в англійському алфавіті має номер', ord(let1) - 96)
    print('літера', let2, 'в англійському алфавіті має номер', ord(let2) - 96)
    distance = abs((ord(let1) - ord(let2)) + 1)
    print('між літерою', let1, 'та літерою', let2, 'відстань ', distance, 'символи(ів)')
else:
    print('літери введено не коректно')